{
  "version": "2.0",
  "exportedAt": "2024-12-31T12:00:00.000Z",
  "deck": {
    "name": "GCP PCA - Security & Compliance",
    "description": "IAM, Compliance, Data protection และ Security best practices สำหรับ GCP Professional Cloud Architect",
    "category": "devops",
    "tags": ["gcp", "certification", "pca", "security", "compliance"],
    "sourceLang": "en",
    "targetLang": "th"
  },
  "cards": [
    {
      "vocab": "How do you design IAM for enterprise organizations?",
      "pronunciation": "Enterprise IAM",
      "meaning": "ออกแบบ IAM สำหรับ enterprise organizations อย่างไร?",
      "example": "IAM hierarchy: Organization → Folders → Projects → Resources. Permissions inherit downward. Design principles: 1) Least privilege: Minimum permissions needed. 2) Separation of duties: No single person has full control. 3) Use groups: Manage permissions via groups, not individuals. 4) Prefer predefined roles: Over primitive (Owner/Editor/Viewer). Role types: 1) Basic (primitive): Owner, Editor, Viewer - too broad. 2) Predefined: Google-defined, granular. 3) Custom: Create for specific needs. Best practices: 1) Cloud Identity for user management. 2) Groups for role assignment. 3) Folders for environment separation. 4) Service accounts for apps, not users. 5) Regular access reviews. Exam tip: Know role hierarchy, when to use custom roles.",
      "exampleTranslation": "IAM hierarchy: Organization → Folders → Projects → Resources Permissions inherit downward Design principles: 1) Least privilege: Minimum permissions needed 2) Separation of duties: No single person has full control 3) Use groups: Manage permissions via groups, ไม่ใช่ individuals 4) Prefer predefined roles: Over primitive (Owner/Editor/Viewer) Role types: 1) Basic (primitive): Owner, Editor, Viewer - too broad 2) Predefined: Google-defined, granular 3) Custom: Create สำหรับ specific needs Best practices: 1) Cloud Identity สำหรับ user management 2) Groups สำหรับ role assignment 3) Folders สำหรับ environment separation 4) Service accounts สำหรับ apps, ไม่ใช่ users 5) Regular access reviews Exam tip: รู้ role hierarchy, เมื่อไหร่ใช้ custom roles"
    },
    {
      "vocab": "How do you manage service accounts securely?",
      "pronunciation": "Service Account Security",
      "meaning": "จัดการ service accounts อย่างปลอดภัยอย่างไร?",
      "example": "Service account types: 1) User-managed: You create and manage. 2) Default: Auto-created (Compute, App Engine) - often over-privileged. 3) Google-managed: For Google services. Best practices: 1) Dedicated SA per service/application. 2) Avoid default service accounts. 3) No user-managed keys when possible. 4) Use attached SA (not key files). 5) Workload Identity for GKE. 6) Short-lived tokens via impersonation. Workload Identity Federation: Allow external workloads (AWS, Azure, on-prem) to use GCP SA without keys. Service account impersonation: User/SA assumes another SA's identity temporarily. Audit: Track SA usage via Cloud Audit Logs. Exam tip: Know Workload Identity, impersonation, avoid key files.",
      "exampleTranslation": "Service account types: 1) User-managed: คุณสร้างและจัดการ 2) Default: Auto-created (Compute, App Engine) - often over-privileged 3) Google-managed: สำหรับ Google services Best practices: 1) Dedicated SA ต่อ service/application 2) หลีกเลี่ยง default service accounts 3) No user-managed keys เมื่อเป็นไปได้ 4) ใช้ attached SA (not key files) 5) Workload Identity สำหรับ GKE 6) Short-lived tokens via impersonation Workload Identity Federation: Allow external workloads (AWS, Azure, on-prem) ใช้ GCP SA โดยไม่ต้องใช้ keys Service account impersonation: User/SA assumes another SA's identity temporarily Audit: Track SA usage via Cloud Audit Logs Exam tip: รู้ Workload Identity, impersonation, avoid key files"
    },
    {
      "vocab": "What are Organization Policies and how do you use them?",
      "pronunciation": "Organization Policies",
      "meaning": "Organization Policies คืออะไร และใช้อย่างไร?",
      "example": "Organization Policies: Constraints enforced across organization/folders/projects. Types: 1) Boolean constraints: Enable/disable features. 2) List constraints: Allow/deny specific values. Common policies: 1) compute.vmExternalIpAccess: Restrict external IPs. 2) iam.disableServiceAccountKeyCreation: No SA keys. 3) gcp.resourceLocations: Restrict resource locations. 4) compute.restrictVpcPeering: Control VPC peering. 5) storage.publicAccessPrevention: No public buckets. Hierarchy: Set at org level, can override at folder/project (if allowed). Custom constraints: Create using CEL (Common Expression Language). Use cases: Compliance enforcement, security baseline, cost control. Exam tip: Know common org policies for security, resource location constraints.",
      "exampleTranslation": "Organization Policies: Constraints enforced across organization/folders/projects Types: 1) Boolean constraints: Enable/disable features 2) List constraints: Allow/deny specific values Common policies: 1) compute.vmExternalIpAccess: Restrict external IPs 2) iam.disableServiceAccountKeyCreation: No SA keys 3) gcp.resourceLocations: Restrict resource locations 4) compute.restrictVpcPeering: Control VPC peering 5) storage.publicAccessPrevention: No public buckets Hierarchy: Set ที่ org level, can override ที่ folder/project (if allowed) Custom constraints: Create ด้วย CEL (Common Expression Language) Use cases: Compliance enforcement, security baseline, cost control Exam tip: รู้ common org policies สำหรับ security, resource location constraints"
    },
    {
      "vocab": "How do you implement data encryption on GCP?",
      "pronunciation": "Data Encryption",
      "meaning": "Implement data encryption บน GCP อย่างไร?",
      "example": "Encryption at rest: 1) Google-managed keys: Default, automatic, no config. 2) Customer-managed (CMEK): Keys in Cloud KMS, you control rotation. 3) Customer-supplied (CSEK): You provide keys (limited services). Encryption in transit: 1) Google-managed: Default between GCP services. 2) Customer-managed: TLS certificates, mTLS. Cloud KMS hierarchy: Project → Key Ring → Key → Key Version. Key types: Symmetric (AES-256), Asymmetric (RSA, EC). Cloud EKM: External Key Manager, keys stay outside GCP. Cloud HSM: Hardware Security Module backed keys. Best practices: CMEK for compliance, automate rotation, separate key rings per app. Exam tip: Know CMEK vs CSEK, when to use Cloud HSM/EKM.",
      "exampleTranslation": "Encryption at rest: 1) Google-managed keys: Default, automatic, no config 2) Customer-managed (CMEK): Keys ใน Cloud KMS, คุณ control rotation 3) Customer-supplied (CSEK): คุณ provide keys (limited services) Encryption in transit: 1) Google-managed: Default ระหว่าง GCP services 2) Customer-managed: TLS certificates, mTLS Cloud KMS hierarchy: Project → Key Ring → Key → Key Version Key types: Symmetric (AES-256), Asymmetric (RSA, EC) Cloud EKM: External Key Manager, keys stay outside GCP Cloud HSM: Hardware Security Module backed keys Best practices: CMEK สำหรับ compliance, automate rotation, separate key rings per app Exam tip: รู้ CMEK vs CSEK, เมื่อไหร่ใช้ Cloud HSM/EKM"
    },
    {
      "vocab": "What is VPC Service Controls and how do you use it?",
      "pronunciation": "VPC Service Controls",
      "meaning": "VPC Service Controls คืออะไร และใช้อย่างไร?",
      "example": "VPC Service Controls: API-level security perimeter. Purpose: 1) Prevent data exfiltration. 2) Restrict which networks can access APIs. 3) Compliance requirements. Components: 1) Service perimeter: Boundary around projects/services. 2) Access levels: Conditions for access (IP, identity, device). 3) Ingress/Egress rules: Allow specific cross-perimeter access. How it works: APIs blocked unless within perimeter or allowed by rules. Protected services: BigQuery, Cloud Storage, GCE, etc. Use cases: 1) Prevent accidental public bucket exposure. 2) Restrict data access to corporate network. 3) Meet compliance requirements. Best practices: Start with dry-run mode, use access levels, monitor violations. Exam tip: Know perimeter concepts, ingress/egress rules, dry-run mode.",
      "exampleTranslation": "VPC Service Controls: API-level security perimeter Purpose: 1) Prevent data exfiltration 2) Restrict which networks can access APIs 3) Compliance requirements Components: 1) Service perimeter: Boundary รอบ projects/services 2) Access levels: Conditions สำหรับ access (IP, identity, device) 3) Ingress/Egress rules: Allow specific cross-perimeter access วิธีทำงาน: APIs blocked unless อยู่ใน perimeter หรือ allowed by rules Protected services: BigQuery, Cloud Storage, GCE, etc. Use cases: 1) Prevent accidental public bucket exposure 2) Restrict data access ไป corporate network 3) Meet compliance requirements Best practices: Start กับ dry-run mode, ใช้ access levels, monitor violations Exam tip: รู้ perimeter concepts, ingress/egress rules, dry-run mode"
    },
    {
      "vocab": "How do you design for compliance requirements?",
      "pronunciation": "Compliance Design",
      "meaning": "ออกแบบสำหรับ compliance requirements อย่างไร?",
      "example": "Common compliance frameworks: HIPAA (healthcare), PCI-DSS (payments), SOC 2 (security), GDPR (privacy), FedRAMP (government). GCP compliance features: 1) Data residency: Organization policies for resource locations. 2) Access controls: IAM, VPC-SC, BeyondCorp. 3) Encryption: CMEK, Cloud HSM, EKM. 4) Audit: Cloud Audit Logs, Access Transparency. 5) DLP: Cloud DLP for sensitive data discovery. Assured Workloads: Pre-configured environments for compliance (FedRAMP, HIPAA, etc.). Access Transparency: Logs of Google admin access to your data. Data residency: Regional resources, org policies to restrict locations. Best practices: Use Assured Workloads for regulated industries, enable Access Transparency, regular audits. Exam tip: Know GCP compliance offerings, Assured Workloads, data residency controls.",
      "exampleTranslation": "Common compliance frameworks: HIPAA (healthcare), PCI-DSS (payments), SOC 2 (security), GDPR (privacy), FedRAMP (government) GCP compliance features: 1) Data residency: Organization policies สำหรับ resource locations 2) Access controls: IAM, VPC-SC, BeyondCorp 3) Encryption: CMEK, Cloud HSM, EKM 4) Audit: Cloud Audit Logs, Access Transparency 5) DLP: Cloud DLP สำหรับ sensitive data discovery Assured Workloads: Pre-configured environments สำหรับ compliance (FedRAMP, HIPAA, etc.) Access Transparency: Logs ของ Google admin access to your data Data residency: Regional resources, org policies เพื่อ restrict locations Best practices: ใช้ Assured Workloads สำหรับ regulated industries, enable Access Transparency, regular audits Exam tip: รู้ GCP compliance offerings, Assured Workloads, data residency controls"
    },
    {
      "vocab": "How do you implement logging and monitoring for security?",
      "pronunciation": "Security Logging",
      "meaning": "Implement logging และ monitoring สำหรับ security อย่างไร?",
      "example": "Audit logging types: 1) Admin Activity: Always on, resource changes (free). 2) Data Access: Read/write data operations (must enable, costs). 3) System Event: GCP system actions. 4) Policy Denied: IAM policy violations. Security monitoring: 1) Security Command Center (SCC): Centralized security dashboard. 2) Event Threat Detection: Detect threats from logs. 3) Container Threat Detection: Runtime threats in GKE. Log export: 1) Cloud Storage: Long-term retention, compliance. 2) BigQuery: Analysis and querying. 3) Pub/Sub: Real-time to SIEM. 4) Splunk, Chronicle: Third-party SIEM. Best practices: Enable data access logs for sensitive resources, export to SIEM, set up alerts for security events. Exam tip: Know audit log types, SCC features, log export destinations.",
      "exampleTranslation": "Audit logging types: 1) Admin Activity: Always on, resource changes (free) 2) Data Access: Read/write data operations (ต้อง enable, costs) 3) System Event: GCP system actions 4) Policy Denied: IAM policy violations Security monitoring: 1) Security Command Center (SCC): Centralized security dashboard 2) Event Threat Detection: Detect threats จาก logs 3) Container Threat Detection: Runtime threats ใน GKE Log export: 1) Cloud Storage: Long-term retention, compliance 2) BigQuery: Analysis และ querying 3) Pub/Sub: Real-time ไป SIEM 4) Splunk, Chronicle: Third-party SIEM Best practices: Enable data access logs สำหรับ sensitive resources, export ไป SIEM, set up alerts สำหรับ security events Exam tip: รู้ audit log types, SCC features, log export destinations"
    },
    {
      "vocab": "What is BeyondCorp and zero-trust security?",
      "pronunciation": "BeyondCorp Zero-Trust",
      "meaning": "BeyondCorp และ zero-trust security คืออะไร?",
      "example": "Zero-trust principles: 1) Never trust, always verify. 2) Access based on identity + context + device. 3) No implicit trust from network location. BeyondCorp Enterprise: Google's zero-trust solution. Components: 1) Identity-Aware Proxy (IAP): Context-aware access to apps. 2) Context-aware access: Conditions (IP, device, time). 3) Endpoint Verification: Device posture checks. 4) BeyondCorp Connector: Access on-prem apps. Implementation: 1) Remove VPN dependency. 2) IAP in front of apps. 3) Access policies based on user + device. 4) Continuous verification. Use cases: Remote workforce, partner access, contractor access, replacing VPN. Exam tip: Know IAP configuration, context-aware access policies, zero-trust vs VPN.",
      "exampleTranslation": "Zero-trust principles: 1) Never trust, always verify 2) Access based on identity + context + device 3) No implicit trust from network location BeyondCorp Enterprise: Google's zero-trust solution Components: 1) Identity-Aware Proxy (IAP): Context-aware access to apps 2) Context-aware access: Conditions (IP, device, time) 3) Endpoint Verification: Device posture checks 4) BeyondCorp Connector: Access on-prem apps Implementation: 1) Remove VPN dependency 2) IAP in front of apps 3) Access policies based on user + device 4) Continuous verification Use cases: Remote workforce, partner access, contractor access, replacing VPN Exam tip: รู้ IAP configuration, context-aware access policies, zero-trust vs VPN"
    }
  ]
}
